//! GM/T 0018-2012 types

#![allow(non_camel_case_types)]
#![allow(non_snake_case)]
#![allow(non_upper_case_globals)]

/// Original C struct
/// ```c
/// typedef struct DeviceInfo_st {
/// 	unsigned char IssuerName[40];
/// 	unsigned char DeviceName[16];
/// 	unsigned char DeviceSerial[16];
/// 	unsigned int DeviceVersion;
/// 	unsigned int StandardVersion;
/// 	unsigned int AsymAlgAbility[2];
/// 	unsigned int SymAlgAbility;
/// 	unsigned int HashAlgAbility;
/// 	unsigned int BufferSize;
/// } DeviceInfo;
/// ```
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct DeviceInfo_st {
    pub IssuerName: [::std::os::raw::c_uchar; 40usize],
    pub DeviceName: [::std::os::raw::c_uchar; 16usize],
    pub DeviceSerial: [::std::os::raw::c_uchar; 16usize],
    pub DeviceVersion: ::std::os::raw::c_uint,
    pub StandardVersion: ::std::os::raw::c_uint,
    pub AsymAlgAbility: [::std::os::raw::c_uint; 2usize],
    pub SymAlgAbility: ::std::os::raw::c_uint,
    pub HashAlgAbility: ::std::os::raw::c_uint,
    pub BufferSize: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DeviceInfo_st"][::std::mem::size_of::<DeviceInfo_st>() - 100usize];
    ["Alignment of DeviceInfo_st"][::std::mem::align_of::<DeviceInfo_st>() - 1usize];
    ["Offset of field: DeviceInfo_st::IssuerName"]
        [::std::mem::offset_of!(DeviceInfo_st, IssuerName) - 0usize];
    ["Offset of field: DeviceInfo_st::DeviceName"]
        [::std::mem::offset_of!(DeviceInfo_st, DeviceName) - 40usize];
    ["Offset of field: DeviceInfo_st::DeviceSerial"]
        [::std::mem::offset_of!(DeviceInfo_st, DeviceSerial) - 56usize];
    ["Offset of field: DeviceInfo_st::DeviceVersion"]
        [::std::mem::offset_of!(DeviceInfo_st, DeviceVersion) - 72usize];
    ["Offset of field: DeviceInfo_st::StandardVersion"]
        [::std::mem::offset_of!(DeviceInfo_st, StandardVersion) - 76usize];
    ["Offset of field: DeviceInfo_st::AsymAlgAbility"]
        [::std::mem::offset_of!(DeviceInfo_st, AsymAlgAbility) - 80usize];
    ["Offset of field: DeviceInfo_st::SymAlgAbility"]
        [::std::mem::offset_of!(DeviceInfo_st, SymAlgAbility) - 88usize];
    ["Offset of field: DeviceInfo_st::HashAlgAbility"]
        [::std::mem::offset_of!(DeviceInfo_st, HashAlgAbility) - 92usize];
    ["Offset of field: DeviceInfo_st::BufferSize"]
        [::std::mem::offset_of!(DeviceInfo_st, BufferSize) - 96usize];
};
pub type DeviceInfo = DeviceInfo_st;

/// Original C struct
/// ```c
/// typedef struct RSArefPublicKey_st {
/// 	unsigned int bits;
/// 	unsigned char m[RSAref_MAX_LEN];
/// 	unsigned char e[RSAref_MAX_LEN];
/// } RSArefPublicKey;
/// ```
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct RSArefPublicKey_st {
    pub bits: ::std::os::raw::c_uint,
    pub m: [::std::os::raw::c_uchar; 256usize],
    pub e: [::std::os::raw::c_uchar; 256usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RSArefPublicKey_st"][::std::mem::size_of::<RSArefPublicKey_st>() - 516usize];
    ["Alignment of RSArefPublicKey_st"][::std::mem::align_of::<RSArefPublicKey_st>() - 1usize];
    ["Offset of field: RSArefPublicKey_st::bits"]
        [::std::mem::offset_of!(RSArefPublicKey_st, bits) - 0usize];
    ["Offset of field: RSArefPublicKey_st::m"]
        [::std::mem::offset_of!(RSArefPublicKey_st, m) - 4usize];
    ["Offset of field: RSArefPublicKey_st::e"]
        [::std::mem::offset_of!(RSArefPublicKey_st, e) - 260usize];
};
pub type RSArefPublicKey = RSArefPublicKey_st;

/// Original C struct
/// ```c
/// typedef struct RSArefPrivateKey_st {
/// 	unsigned int bits;
/// 	unsigned char m[RSAref_MAX_LEN];
/// 	unsigned char e[RSAref_MAX_LEN];
/// 	unsigned char d[RSAref_MAX_LEN];
/// 	unsigned char prime[2][RSAref_MAX_PLEN];
/// 	unsigned char pexp[2][RSAref_MAX_PLEN];
/// 	unsigned char coef[RSAref_MAX_PLEN];
/// } RSArefPrivateKey;
/// ```
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct RSArefPrivateKey_st {
    pub bits: ::std::os::raw::c_uint,
    pub m: [::std::os::raw::c_uchar; 256usize],
    pub e: [::std::os::raw::c_uchar; 256usize],
    pub d: [::std::os::raw::c_uchar; 256usize],
    pub prime: [[::std::os::raw::c_uchar; 128usize]; 2usize],
    pub pexp: [[::std::os::raw::c_uchar; 128usize]; 2usize],
    pub coef: [::std::os::raw::c_uchar; 128usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RSArefPrivateKey_st"][::std::mem::size_of::<RSArefPrivateKey_st>() - 1412usize];
    ["Alignment of RSArefPrivateKey_st"][::std::mem::align_of::<RSArefPrivateKey_st>() - 1usize];
    ["Offset of field: RSArefPrivateKey_st::bits"]
        [::std::mem::offset_of!(RSArefPrivateKey_st, bits) - 0usize];
    ["Offset of field: RSArefPrivateKey_st::m"]
        [::std::mem::offset_of!(RSArefPrivateKey_st, m) - 4usize];
    ["Offset of field: RSArefPrivateKey_st::e"]
        [::std::mem::offset_of!(RSArefPrivateKey_st, e) - 260usize];
    ["Offset of field: RSArefPrivateKey_st::d"]
        [::std::mem::offset_of!(RSArefPrivateKey_st, d) - 516usize];
    ["Offset of field: RSArefPrivateKey_st::prime"]
        [::std::mem::offset_of!(RSArefPrivateKey_st, prime) - 772usize];
    ["Offset of field: RSArefPrivateKey_st::pexp"]
        [::std::mem::offset_of!(RSArefPrivateKey_st, pexp) - 1028usize];
    ["Offset of field: RSArefPrivateKey_st::coef"]
        [::std::mem::offset_of!(RSArefPrivateKey_st, coef) - 1284usize];
};
pub type RSArefPrivateKey = RSArefPrivateKey_st;

/// Original C struct
/// ```c
/// typedef struct ECCrefPublicKey_st {
/// 	unsigned int bits;
/// 	unsigned char x[ECCref_MAX_LEN];
/// 	unsigned char y[ECCref_MAX_LEN];
/// } ECCrefPublicKey;
/// ```
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ECCrefPublicKey_st {
    pub bits: ::std::os::raw::c_uint,
    pub x: [::std::os::raw::c_uchar; 64usize],
    pub y: [::std::os::raw::c_uchar; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ECCrefPublicKey_st"][::std::mem::size_of::<ECCrefPublicKey_st>() - 132usize];
    ["Alignment of ECCrefPublicKey_st"][::std::mem::align_of::<ECCrefPublicKey_st>() - 1usize];
    ["Offset of field: ECCrefPublicKey_st::bits"]
        [::std::mem::offset_of!(ECCrefPublicKey_st, bits) - 0usize];
    ["Offset of field: ECCrefPublicKey_st::x"]
        [::std::mem::offset_of!(ECCrefPublicKey_st, x) - 4usize];
    ["Offset of field: ECCrefPublicKey_st::y"]
        [::std::mem::offset_of!(ECCrefPublicKey_st, y) - 68usize];
};
pub type ECCrefPublicKey = ECCrefPublicKey_st;

/// Original C struct
/// ```c
/// typedef struct ECCrefPrivateKey_st {
/// 	unsigned int bits;
/// 	unsigned char K[ECCref_MAX_LEN];
/// } ECCrefPrivateKey;
/// ```
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ECCrefPrivateKey_st {
    pub bits: ::std::os::raw::c_uint,
    pub K: [::std::os::raw::c_uchar; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ECCrefPrivateKey_st"][::std::mem::size_of::<ECCrefPrivateKey_st>() - 68usize];
    ["Alignment of ECCrefPrivateKey_st"][::std::mem::align_of::<ECCrefPrivateKey_st>() - 1usize];
    ["Offset of field: ECCrefPrivateKey_st::bits"]
        [::std::mem::offset_of!(ECCrefPrivateKey_st, bits) - 0usize];
    ["Offset of field: ECCrefPrivateKey_st::K"]
        [::std::mem::offset_of!(ECCrefPrivateKey_st, K) - 4usize];
};
pub type ECCrefPrivateKey = ECCrefPrivateKey_st;

/// Original C struct
/// ```c
/// typedef struct ECCCipher_st {
/// 	unsigned char x[ECCref_MAX_LEN];
/// 	unsigned char y[ECCref_MAX_LEN];
/// 	unsigned char M[32];
/// 	unsigned int L;
/// 	unsigned char C;
/// } ECCCipher;
/// ```
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ECCCipher_st {
    pub x: [::std::os::raw::c_uchar; 64usize],
    pub y: [::std::os::raw::c_uchar; 64usize],
    pub M: [::std::os::raw::c_uchar; 32usize],
    pub L: ::std::os::raw::c_uint,
    pub C: [::std::os::raw::c_uchar; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ECCCipher_st"][::std::mem::size_of::<ECCCipher_st>() - 165usize];
    ["Alignment of ECCCipher_st"][::std::mem::align_of::<ECCCipher_st>() - 1usize];
    ["Offset of field: ECCCipher_st::x"][::std::mem::offset_of!(ECCCipher_st, x) - 0usize];
    ["Offset of field: ECCCipher_st::y"][::std::mem::offset_of!(ECCCipher_st, y) - 64usize];
    ["Offset of field: ECCCipher_st::M"][::std::mem::offset_of!(ECCCipher_st, M) - 128usize];
    ["Offset of field: ECCCipher_st::L"][::std::mem::offset_of!(ECCCipher_st, L) - 160usize];
    ["Offset of field: ECCCipher_st::C"][::std::mem::offset_of!(ECCCipher_st, C) - 164usize];
};
pub type ECCCipher = ECCCipher_st;

/// Original C struct
/// ```c
/// typedef struct ECCSignature_st {
/// 	unsigned char r[ECCref_MAX_LEN];
/// 	unsigned char s[ECCref_MAX_LEN];
/// } ECCSignature;
/// ```
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ECCSignature_st {
    pub r: [::std::os::raw::c_uchar; 64usize],
    pub s: [::std::os::raw::c_uchar; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ECCSignature_st"][::std::mem::size_of::<ECCSignature_st>() - 128usize];
    ["Alignment of ECCSignature_st"][::std::mem::align_of::<ECCSignature_st>() - 1usize];
    ["Offset of field: ECCSignature_st::r"][::std::mem::offset_of!(ECCSignature_st, r) - 0usize];
    ["Offset of field: ECCSignature_st::s"][::std::mem::offset_of!(ECCSignature_st, s) - 64usize];
};
pub type ECCSignature = ECCSignature_st;

/// Original C struct
/// ```c
/// typedef struct SDF_ENVELOPEDKEYBLOB {
/// 	unsigned long Version;
/// 	unsigned long ulSymmAlgID;
/// 	ECCCipher ECCCipehrBlob;
/// 	ECCrefPublicKey PubKey;
/// 	unsigned char cbEncryptedPrivKey[ECCref_MAX_LEN];
/// } SDF_ENVELOPEDKEYBLOB;
/// ```
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct EnvelopedKeyBlob_st {
    pub Version: ::std::os::raw::c_ulong,
    pub ulSymmAlgID: ::std::os::raw::c_ulong,
    pub ECCCipehrBlob: ECCCipher,
    pub PubKey: ECCrefPublicKey,
    pub cbEncryptedPrivKey: [::std::os::raw::c_uchar; 64usize],
}
// c_ulong is platform dependent
const ULONG_SIZE: usize = ::std::mem::size_of::<::std::os::raw::c_ulong>();

#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    const EXPECTED_SIZE: usize = ULONG_SIZE * 2 + 165 + 132 + 64;
    ["Size of EnvelopedKeyBlob_st"][::std::mem::size_of::<EnvelopedKeyBlob_st>() - EXPECTED_SIZE];
    ["Alignment of EnvelopedKeyBlob_st"][::std::mem::align_of::<EnvelopedKeyBlob_st>() - 1usize];
    ["Offset of field: EnvelopedKeyBlob_st::Version"]
        [::std::mem::offset_of!(EnvelopedKeyBlob_st, Version) - 0usize];
    ["Offset of field: EnvelopedKeyBlob_st::ulSymmAlgID"]
        [::std::mem::offset_of!(EnvelopedKeyBlob_st, ulSymmAlgID) - ULONG_SIZE];
    ["Offset of field: EnvelopedKeyBlob_st::ECCCipehrBlob"]
        [::std::mem::offset_of!(EnvelopedKeyBlob_st, ECCCipehrBlob) - (ULONG_SIZE * 2)];
    ["Offset of field: EnvelopedKeyBlob_st::PubKey"]
        [::std::mem::offset_of!(EnvelopedKeyBlob_st, PubKey) - (ULONG_SIZE * 2 + 165)];
    ["Offset of field: EnvelopedKeyBlob_st::cbEncryptedPrivKey"]
        [::std::mem::offset_of!(EnvelopedKeyBlob_st, cbEncryptedPrivKey) - (ULONG_SIZE * 2 + 165 + 132)];
};
pub type EnvelopedKeyBlob = EnvelopedKeyBlob_st;
pub type PEnvelopedKeyBlob = *mut EnvelopedKeyBlob_st;

unsafe extern "C" {
    pub fn SDF_OpenDevice(
        phDeviceHandle: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn SDF_CloseDevice(hDeviceHandle: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn SDF_OpenSession(
        hDeviceHandle: *mut ::std::os::raw::c_void,
        phSessionHandle: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn SDF_CloseSession(hSessionHandle: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn SDF_GetDeviceInfo(
        hSessionHandle: *mut ::std::os::raw::c_void,
        pstDeviceInfo: *mut DeviceInfo,
